In [25]:
import numpy as np
import pandas as pd

In [26]:
df = pd.read_csv('../iniadMaterial/AI-0102/pandas_training-utf8.csv',delimiter=',', skiprows=13, header=0)
display(df)

    CHANNEL REGION  FRESH   MILK  GROCERY  FROZEN  DET_PAPER  DELICA
0    Retail  Other  12669   9656     7561     214       2674    1338
1    Retail  Other   7057   9810     9568    1762       3293    1776
2    Retail  Other   6353   8808     7684    2405       3516    7844
3    Horeca  Other  13265   1196     4221    6404        507    1788
4    Retail  Other  22615   5410     7198    3915       1777    5185
..      ...    ...    ...    ...      ...     ...        ...     ...
435  Horeca  Other  29703  12051    16027   13135        182    2204
436  Horeca  Other  39228   1431      764    4510         93    2346
437  Retail  Other  14531  15488    30243     437      14841    1867
438  Horeca  Other  10290   1981     2232    1038        168    2125
439  Horeca  Other   2787   1698     2510      65        477      52

[440 rows x 8 columns]

In [27]:
id_col_max = df['FRESH'].idxmax()
print( id_col_max )
print(df.loc[ id_col_max ])

181
CHANNEL      Horeca
REGION        Other
FRESH        112151
MILK          29627
GROCERY       18148
FROZEN        16745
DET_PAPER      4948
DELICA         8550
Name: 181, dtype: object

In [28]:
df_10k = df[ df['FRESH'] > 50000 ]
display(df_10k)

    CHANNEL  REGION   FRESH   MILK  GROCERY  FROZEN  DET_PAPER  DELICA
39   Horeca   Other   56159    555      902   10002        212    2916
103  Horeca   Other   56082   3504     8906   18028       1480    2498
125  Horeca   Other   76237   3473     7102   16538        778     918
181  Horeca   Other  112151  29627    18148   16745       4948    8550
258  Horeca  Lisbon   56083   4563     2124    6422        730    3321
259  Horeca  Lisbon   53205   4959     7336    3012        967     818
284  Horeca   Other   68951   4411    12609    8692        751    2406

In [29]:
df_10k.reset_index()

   index CHANNEL  REGION   FRESH   MILK  GROCERY  FROZEN  DET_PAPER  DELICA
0     39  Horeca   Other   56159    555      902   10002        212    2916
1    103  Horeca   Other   56082   3504     8906   18028       1480    2498
2    125  Horeca   Other   76237   3473     7102   16538        778     918
3    181  Horeca   Other  112151  29627    18148   16745       4948    8550
4    258  Horeca  Lisbon   56083   4563     2124    6422        730    3321
5    259  Horeca  Lisbon   53205   4959     7336    3012        967     818
6    284  Horeca   Other   68951   4411    12609    8692        751    2406

In [30]:
df_10k.reset_index(drop=True)

  CHANNEL  REGION   FRESH   MILK  GROCERY  FROZEN  DET_PAPER  DELICA
0  Horeca   Other   56159    555      902   10002        212    2916
1  Horeca   Other   56082   3504     8906   18028       1480    2498
2  Horeca   Other   76237   3473     7102   16538        778     918
3  Horeca   Other  112151  29627    18148   16745       4948    8550
4  Horeca  Lisbon   56083   4563     2124    6422        730    3321
5  Horeca  Lisbon   53205   4959     7336    3012        967     818
6  Horeca   Other   68951   4411    12609    8692        751    2406

In [33]:
inplace_df_10k = df_10k.reset_index(drop=False, inplace=True)
display(inplace_df_10k)

None